
## Plan Result (client-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/55099)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Delete
  * aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9
  * aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C
  * aws_security_group.memcached_elasticache_security_group_B1576B6B
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:396" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "PORT"
                            value = "4001"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "4a52fb01178e61b1ac264d94b31d668c4f9379b9" -> "3732004b8f363741983a4448f2206420f04e3a77"
                        },
                    ]
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/clientapi-prod-app:4a52fb01178e61b1ac264d94b31d668c4f9379b9" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/clientapi-prod-app:3732004b8f363741983a4448f2206420f04e3a77"
                    name                   = "app"
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ClientAPI-Prod" -> (known after apply)
      ~ revision                 = 396 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ClientAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9 will be destroyed
  # (because aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9 is not in configuration)
  - resource "aws_elasticache_cluster" "memcached_elasticache_cluster_3C71B9D9" {
      - apply_immediately          = true -> null
      - arn                        = "arn:aws:elasticache:us-east-1:996905175585:cluster:clientapi-prod" -> null
      - auto_minor_version_upgrade = "true" -> null
      - availability_zone          = "us-east-1d" -> null
      - az_mode                    = "single-az" -> null
      - cache_nodes                = [
          - {
              - address           = "clientapi-prod.zcx42u.0001.use1.cache.amazonaws.com"
              - availability_zone = "us-east-1d"
              - id                = "0001"
              - outpost_arn       = ""
              - port              = 11211
            },
          - {
              - address           = "clientapi-prod.zcx42u.0002.use1.cache.amazonaws.com"
              - availability_zone = "us-east-1d"
              - id                = "0002"
              - outpost_arn       = ""
              - port              = 11211
            },
        ] -> null
      - cluster_address            = "clientapi-prod.zcx42u.cfg.use1.cache.amazonaws.com" -> null
      - cluster_id                 = "clientapi-prod" -> null
      - configuration_endpoint     = "clientapi-prod.zcx42u.cfg.use1.cache.amazonaws.com:11211" -> null
      - engine                     = "memcached" -> null
      - engine_version             = "1.6.6" -> null
      - engine_version_actual      = "1.6.6" -> null
      - id                         = "clientapi-prod" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "fri:03:00-fri:04:00" -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t3.medium" -> null
      - num_cache_nodes            = 2 -> null
      - parameter_group_name       = "default.memcached1.6" -> null
      - port                       = 11211 -> null
      - security_group_ids         = [
          - "sg-0f7a28a3b531bc77d",
        ] -> null
      - snapshot_retention_limit   = 0 -> null
      - subnet_group_name          = "clientapi-prod-elasticachesubnetgroup" -> null
      - tags                       = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all                   = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - transit_encryption_enabled = false -> null
    }

  # aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C will be destroyed
  # (because aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C is not in configuration)
  - resource "aws_elasticache_subnet_group" "memcached_elasticache_subnet_group_F45C696C" {
      - arn         = "arn:aws:elasticache:us-east-1:996905175585:subnetgroup:clientapi-prod-elasticachesubnetgroup" -> null
      - description = "Managed by Terraform" -> null
      - id          = "clientapi-prod-elasticachesubnetgroup" -> null
      - name        = "clientapi-prod-elasticachesubnetgroup" -> null
      - subnet_ids  = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
          - "subnet-d09eb8ec",
        ] -> null
      - tags        = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all    = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
    }

  # aws_security_group.memcached_elasticache_security_group_B1576B6B will be destroyed
  # (because aws_security_group.memcached_elasticache_security_group_B1576B6B is not in configuration)
  - resource "aws_security_group" "memcached_elasticache_security_group_B1576B6B" {
      - arn                    = "arn:aws:ec2:us-east-1:996905175585:security-group/sg-0f7a28a3b531bc77d" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0f7a28a3b531bc77d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 11211
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 11211
            },
        ] -> null
      - name                   = "ClientAPI-Prod20210222225802207000000001" -> null
      - name_prefix            = "ClientAPI-Prod" -> null
      - owner_id               = "996905175585" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all               = {
          - "environment" = "Prod"
          - "service"     = "ClientAPI"
        } -> null
      - vpc_id                 = "vpc-867638e3" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"2bff25a8-55ad-4860-a992-0916fc5868ec","JobName":"client-api_infrastructure_plan_prod","PRNumber":195,"Program":"tfcmt","SHA1":"3732004b8f363741983a4448f2206420f04e3a77","Target":"client-api-cdk","Vars":{}} -->